Revit 2024 API
Application.WorksharedOperationProgressChanged Event
 Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public event EventHandler<WorksharedOperationProgressChangedEventArgs> WorksharedOperationProgressChanged
Visual Basic
Public Event WorksharedOperationProgressChanged As EventHandler(Of WorksharedOperationProgressChangedEventArgs)
Visual C++
public:
 event EventHandler<WorksharedOperationProgressChangedEventArgs^>^ WorksharedOperationProgressChanged {
	void add (EventHandler<WorksharedOperationProgressChangedEventArgs^>^ value);
	void remove (EventHandler<WorksharedOperationProgressChangedEventArgs^>^ value);
}
Remarks
 This event is only supported for Collaboration for Revit and will not be raised for those operations occurring in local-worksharing and Revit Server workflow. Users may not change the document in the handler for this event. It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time." Exception ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace